[
  {
    "path": "posts/2021-05-25-datavizmakeover1/",
    "title": "DataViz Makeover1",
    "description": "DataViz Makeover 1 for ISSS608: Visual Analytics",
    "author": [
      {
        "name": "Li ShuXian",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2021-05-30",
    "categories": [],
    "contents": "\r\n\r\nContents\r\n1.0 Critique of Visualisation\r\n1.1 Clarity\r\n1.2 Aesthetic\r\n\r\n2.0 Alternative Design\r\n2.1 Clarity\r\n2.2 Aesthetic\r\n\r\n3.0 Proposed Visualisation\r\n4.0 Step-by-step Guide\r\n5.0 Derived Insights\r\n\r\n1.0 Critique of Visualisation\r\nThe original visualisation is shown below.\r\n\r\n1.1 Clarity\r\nThe title emphasized “Top Six Trading Countries” without explaining how it was calculated whether it ranks by export or import or a total of export and import. Furthermore, Hong Kong belongs to China, so there are only five countries in total.\r\nThe title contained a timeline of 2019 and 2020 but it is inconsistent with the graph. The month of period in Japan only showed 2020 data, lacking data in 2019. In contrast, the rest of the countries in the graph showed from 2019 to 2021.\r\nThe title of the x-axis “Month of Period” is incorrect as the unit of the x-axis is a year.\r\nThe scale of Y1 Export axis and Y2 Import axis are different in one country. Therefore, it is hard to compare without scale standardization. For example, the scale of Hong Kong export ranges from 0 million to 6 million while its import ranges from 0 k to 800 k. Furthermore, among different countries, the scale of Y1 Export axis and Y2 Import varies as well. Readers might be misled and compare countries without reading the scale and conclude wrongly.\r\n1.2 Aesthetic\r\nThe title emphasized “Top Six Trading Countries” while the graph did not put an individual country in order. For example, Hong Kong is the first country in the chart but it did not have the highest ranking in the view of both import and export.\r\nAnnotations are not used to convey essential insights that readers might miss on.\r\nSaturation and contrast between color of export and import is not enough.\r\n2.0 Alternative Design\r\nThe proposed design is shown in the following.\r\n\r\n2.1 Clarity\r\nBased on the total dataset given, these 5 countries are not the top trading countries in the world so the title has been changed and name of country Hong Kong becomes Hong Kong China explain why there are total 5 countries.\r\nScale of Y-axis is standardized to 0 M to 140 M and there is no secondary y-axis which is reader friendly.\r\nLine graph is used and clearly illustrate trend of import and export trading in 2019 and 2010. Area graph explains to reader about country ranking in terms of total trade.\r\n2.2 Aesthetic\r\nAnnotations are used to emphases key observations.\r\nBright and contrastive colors are applied so that readers can focus on their interested category.\r\nTick marks are not used for categories.\r\n3.0 Proposed Visualisation\r\nFor a clearer graph, please click the link on Tableau Public here.\r\n4.0 Step-by-step Guide\r\nThe timeframe of the dataset covers from 1976 January to 2021 April. As required, only data between 2019 and 2020 were copied and pasted into a new sheet using Microsoft Excel. \r\nConvert Text to Columns Wizard function was used to separate country names and monetary units. \r\nAdd belonging country name China behind HK so that readers would not take HK as a country in both import and export sheet. \r\n4.Data of continents were removed because our target variables are countries. \r\n5.Delete monetary unit column and import the data into Tableau. \r\n6.Pivot the table from Jan 2019 to Dec 2020 in both export and import sheet. \r\n7.Build relationship for import and export sheet based on variable names and pivot field name. \r\n8.Drag variables, pivot field names to columns, measure values (Pivot 1) to rows. \r\n9.Filter variables and select the predefined 6 countries. \r\n10.Add measure name to the Color side panel to differentiate the import and export in the graph. \r\n11.Remove count of import and export from measure values. \r\n12.Rename all the variables. \r\n13.Edit title y-axis to trading volume and fix the range of trading volume to 140M. \r\n14.Similarly, change tick interval of y-xais to 20M. Turn off the minor tick marks. \r\n15.Delete name of x-axis as value of year is shown. \r\n16.Add a new variable called total trade. \r\n17.Drag total trade to secondary y-axis and change type of graph into area. \r\n18.Edit color and of it. \r\n19.Hide header of secondary y-axis. \r\n20.Hide field labels for columns \r\n21.Rename the worksheet. \r\n22.Use annotations to add insights into the graph. \r\n23.Rank countries in descending order base on total trade. The final dashboard is ready. \r\n5.0 Derived Insights\r\nLooking at Import/Export Trading Volume, China had the highest volume in both import and export trading as compared to the rest of the countries in the chart. Mainland China had a marginally increased volume in export. But a slightly decreased volume in import volume. The analysis clearly shows that China had an impressive rebound while the world trade recovered slowly. The main reason was a serious lock-down order was made by the government. After things were well controlled, the business and trading remained as usual.\r\nPIEE,2020\r\nLarge decreases of export trading from 56M to 46M were occurred in Malaysia. And this was caused by the COVID-19 pandemic situation. While the import volume did increase a little.\r\nMalaysia External Trade Statistics\r\nIn United States, a steep decrement of import volume from 59.7M to 48M was appeared due to the result of U.S tariffs imposed on imports from China back in Sep 2019. In contrast the export volume started from 45.3M increased to 54M.\r\nBrookings,2020\r\nAs for Taiwan, we can concur that both import and export volumes had increased, whereas the import volume had a steeper and larger increment from 44M to 50M.\r\n5.Summary of Total Trading Volume (TTV):\r\nBy comparing the TTV between the year 2019 to 2020, there is a significant difference between Mainland China to the rest of the countries in the chart. Mainland China had the largest TTV of close to 136M. To break down the TTV differences between the year 2019 and 2020, we can clearly observe that Mainland China, United States and Japan were having a slightly decreased volume roughly about 1M to 2M. Malaysia had an obvious declined TTV as the volume dropped from 113M to 103.4M. Both Taiwan and Hong Kong China had an increased volume from 66.5M to 75.2M and 65.3M to 69M respectively.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-05-30T16:29:27+08:00",
    "input_file": "datavizmakeover1.knit.md"
  }
]
